{
  "name": "Arushi Singh",
  "role": "Software Engineer",
  "location": "Pune, India",
  "phone": "9403316920",
  "email": "arukajal2399@gmail.com",
  "links": {
    "LinkedIn": "https://www.linkedin.com/in/arushi-s-1bba89179",
    "GitHub": "https://github.com/arukajal"
  },
  "profile": "Full-Stack Developer | 3D Visualization & Frontend Engineering Innovative developer with hands-on experience building GitHub-like collaboration platforms for 3D models, integrating Rhino, OBJ, GLTF, and Forge Viewer for seamless visualization. Skilled in React, React Three Fiber, Material UI, and performance optimization, with a strong focus on creating reusable component libraries, measurement tools, and scalable architectures. Proven ability to deliver end-to-end modules under tight deadlines, driving measurable business impact — including a $150K revenue boost through rapid feature delivery.",
  "skills": [
    "Javascript",
    "HTML",
    "CSS",
    "React JS/TS/Native",
    "Redux",
    "ThreeJS",
    "React Three FIber",
    "AWS Services",
    "Material UI",
    "Bootstrap",
    "Flask (RESTFUL APIs)",
    "AWS DynamoDB",
    "AWS Cognito",
    "AWS S3 services",
    "AWS EC2",
    "AutoDesk Forge Viewer",
    "Web Design",
    "Tanstack",
    "Zustand",
    "GraphQL",
    "TypeScript",
    "AutoDesk Platform Services"
    
  ],
  "experience": [
    {
      "title": "Software Engineer",
      "company": "Stealth Startup",
      "dates": "2024 – Present",
      "bullets": [
        "Developed a GitHub-like 3D collaboration platform enabling version control, visualization, and interaction with 3D models, improving design review workflows.",
        "Built a reusable component library using Material UI, with standardized height/width and styles, ensuring design consistency and faster feature delivery across the product.",
        "Optimized rendering performance in React Three Fiber, reducing load times and improving user experience for complex 3D models.",
        "Implemented measurement tools inside the 3D environment, allowing users to take accurate real-time dimensions directly on models.",
        "Integrated multi-format 3D visualization pipelines, enabling seamless rendering of Rhino (.3dm), OBJ, and GLTF models for broad interoperability.",
        "Worked with Autodesk Forge Viewer to extend model viewing capabilities, including loading, manipulation, and cross-platform visualization of BIM and CAD data.",
        "Contributed to scalable frontend architecture, ensuring modularity, reusability, and maintainability in a fast-paced startup environment."

      ],
      "achievements": ["Delivered a full 3D collaboration module in under 15 days, accelerating go-market and directly contributing to $150K in company revenue.",
        "Spearheaded end-to-end development of a critical product feature within two weeks, enabling the startup to secure $150K in profit through rapid client adoption"]
    },
    {
      "title": "Team Lead",
      "company": "Centre for Computational Technologies Pvt. Ltd. (CCTech)",
      "dates": "2023 – 2024",
      "bullets": [
        "Created a dashboard with 10+ applications; handled customer meetings and presented frontend updates.",
        "Developed core logic and problem-solving solutions for new feature implementation.",
        "Built reusable code and libraries to accelerate future development.",
        "Worked on Flair 3D project, visualizing 3D sensors on the frontend."
      ],
      "achievements": ["Optimized application speed by 50%"]
    },
    {
      "title": "Member of Technical Staff",
      "company": "Centre for Computational Technologies Pvt. Ltd. (CCTech)",
      "dates": "2021 – 2023",
      "bullets": [
        "Implemented web apps and landing pages end-to-end with ReactJS, Python, and AWS.",
        "Standardized UI with a responsive, user-friendly approach; validated all user inputs before submission.",
        "Collaborated with designers to translate visuals into functional pages; assessed UX and UI feasibility."
      ],
      "achievements": ["Reduced bugs by 40% by eliminating prop drilling"]
    }
  ],
  "projects": [
    {
      "name": "BIM Structure Viewer",
      "summary": "A performant BIM viewer replacing legacy pipelines, with camera controls, sectioning, and material toggles.",
      "dates": "2024–2025",
      "stack": [
        "React",
        "Three.js (r167)",
        "Zustand"
      ],
      "links": {
        "Demo": "#",
        "Code": "#"
      }
    },
    {
      "name": "Flair 3D — Sensor Visualization",
      "summary": "Visualizes 3D sensors and live states in a responsive WebGL interface for engineering teams.",
      "dates": "2023",
      "stack": [
        "React",
        "Three.js",
        "MUI"
      ],
      "links": {
        "Case study": "#",
        "Code": "#"
      }
    },
    {
      "name": "Satellite Orbit Visualizer",
      "summary": "CesiumJS app to simulate satellite orbit, orientation and field of view with interactive controls.",
      "dates": "2024",
      "stack": [
        "CesiumJS",
        "React"
      ],
      "links": {
        "Code": "#"
      }
    },
    {
      "name": "OBJ/GLTF Pipeline (Backend-driven)",
      "summary": "Shifted column/beam generation to backend and streamed OBJ/GLTF to the client; cached parts in IndexedDB.",
      "dates": "2024",
      "stack": [
        "GLTF/OBJ",
        "IndexedDB",
        "Web Workers"
      ],
      "links": {
        "Notes": "#"
      }
    },
    {
      "name": "Dimensioned Geometry Tool",
      "summary": "Three.js utility to add dimension lines with arrows/labels around meshes; interactive resizing and offsets.",
      "dates": "2024",
      "stack": [
        "Three.js",
        "TypeScript"
      ],
      "links": {
        "Code": "#"
      }
    }
  ],
  "education": [
    {
      "degree": "Bachelor of Engineering",
      "institution": "PES's Modern College of Engineering"
    },
    {
      "degree": "Higher Secondary School",
      "institution": "St. Mira's College for Girls"
    }
  ]
}